benchmark/wrk_10_20260208_191258.txt
Running 20s test @ http://localhost:9001/
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.14ms  496.86us  20.94ms   88.06%
    Req/Sec     1.54k   154.25     1.83k    84.43%
  Latency Distribution
     50%    1.08ms
     75%    1.28ms
     90%    1.54ms
     99%    2.58ms
  122773 requests in 20.11s, 530.98MB read
Requests/sec:   6106.21
Transfer/sec:     26.41MB