benchmark/wrk_10_20260208_191936.txt
Running 20s test @ http://localhost:9001/
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.28ms   18.11ms 438.17ms   98.05%
    Req/Sec   758.49    305.29     2.71k    89.42%
  Latency Distribution
     50%    2.14ms
     75%    2.64ms
     90%    3.45ms
     99%   73.11ms
  60133 requests in 20.10s, 260.07MB read
Requests/sec:   2991.74
Transfer/sec:     12.94MB