benchmark/wrk_150_20260208_191258.txt
Running 20s test @ http://localhost:9001/
  4 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.59ms   31.89ms 576.09ms   88.73%
    Req/Sec   747.04    357.17     2.17k    78.22%
  Latency Distribution
     50%   42.09ms
     75%   48.12ms
     90%   62.05ms
     99%  176.62ms
  59149 requests in 20.06s, 255.81MB read
Requests/sec:   2949.13
Transfer/sec:     12.75MB