benchmark/wrk_150_20260208_191936.txt
Running 20s test @ http://localhost:9001/
  4 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.76ms    3.20ms  45.38ms   83.23%
    Req/Sec     1.73k   161.60     2.46k    71.62%
  Latency Distribution
     50%   17.75ms
     75%   18.67ms
     90%   20.80ms
     99%   26.84ms
  138184 requests in 20.08s, 597.63MB read
  Socket errors: connect 0, read 364, write 0, timeout 0
Requests/sec:   6880.69
Transfer/sec:     29.76MB