benchmark/wrk_200_20260208_191936.txt
Running 20s test @ http://localhost:9001/
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    37.28ms    6.91ms 118.14ms   88.10%
    Req/Sec   831.44    177.92     2.91k    87.39%
  Latency Distribution
     50%   37.68ms
     75%   40.15ms
     90%   41.51ms
     99%   58.87ms
  66282 requests in 20.10s, 286.66MB read
  Socket errors: connect 0, read 545, write 0, timeout 0
Requests/sec:   3297.24
Transfer/sec:     14.26MB