benchmark/wrk_25_20260208_191258.txt
Running 20s test @ http://localhost:9001/
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.14ms    5.04ms  44.13ms   69.12%
    Req/Sec   464.24    236.79     1.49k    86.46%
  Latency Distribution
     50%    6.06ms
     75%   10.21ms
     90%   14.05ms
     99%   21.82ms
  36962 requests in 20.10s, 159.86MB read
Requests/sec:   1838.83
Transfer/sec:      7.95MB