benchmark/wrk_300_20260208_191936.txt
Running 20s test @ http://localhost:9001/
  4 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.93ms    5.30ms 117.13ms   90.38%
    Req/Sec     1.63k   395.01     2.42k    69.95%
  Latency Distribution
     50%   17.50ms
     75%   18.97ms
     90%   23.49ms
     99%   41.99ms
  128979 requests in 20.10s, 557.82MB read
  Socket errors: connect 0, read 8594, write 0, timeout 0
Requests/sec:   6415.99
Transfer/sec:     27.75MB