benchmark/wrk_350_20260208_191936.txt
Running 20s test @ http://localhost:9001/
  4 threads and 350 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.04ms   23.63ms 427.22ms   95.58%
    Req/Sec   728.86    258.99     1.33k    74.51%
  Latency Distribution
     50%   36.91ms
     75%   41.69ms
     90%   47.95ms
     99%  165.90ms
  57089 requests in 20.09s, 246.91MB read
  Socket errors: connect 0, read 11532, write 0, timeout 0
Requests/sec:   2841.06
Transfer/sec:     12.29MB