benchmark/wrk_50_20260208_191258.txt
Running 20s test @ http://localhost:9001/
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.94ms    3.31ms  62.92ms   76.98%
    Req/Sec     1.11k   423.95     2.22k    54.82%
  Latency Distribution
     50%    7.57ms
     75%    8.74ms
     90%   11.64ms
     99%   18.54ms
  88320 requests in 20.08s, 381.98MB read
Requests/sec:   4397.75
Transfer/sec:     19.02MB